RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_dsp2_misc.h
/** @defgroup  DSP2_MISC_ACTIVE_LEVEL_TYPE
 *  @{
 */
#define IS_DSP2_MISC_ACTIVE_LEVEL_TYPE(type) (((type) == DSP2_MISC_ACTIVE_HIGH) || \
                                             ((type) == DSP2_MISC_ACTIVE_LOW))

/** @defgroup  DSP2_MISC_TSRC_SOURCE_TYPE
 *  @{
 */
#define IS_DSP2_MISC_TSRC_SOURCE_TYPE(type) (((type) == DSP2_MISC_TSRC_SOURCE_DVP) || \
                                            ((type) == DSP2_MISC_TSRC_SOURCE_CSI))

/** @defgroup  DSP2_MISC_CAM_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_CAM_ID_TYPE(type) (((type) == DSP2_MISC_CAM_0_ID) || \
                                       ((type) == DSP2_MISC_CAM_1_ID) || \
                                       ((type) == DSP2_MISC_CAM_2_ID) || \
                                       ((type) == DSP2_MISC_CAM_3_ID) || \
                                       ((type) == DSP2_MISC_CAM_4_ID) || \
                                       ((type) == DSP2_MISC_CAM_5_ID) || \
                                       ((type) == DSP2_MISC_CAM_6_ID) || \
                                       ((type) == DSP2_MISC_CAM_7_ID) || \
                                       ((type) == DSP2_MISC_CAM_ID_MAX))

/** @defgroup  DSP2_MISC_CROP_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_CROP_ID_TYPE(type) (((type) == DSP2_MISC_CROP_0_ID) || \
                                        ((type) == DSP2_MISC_CROP_1_ID) || \
                                        ((type) == DSP2_MISC_CROP_2_ID) || \
                                        ((type) == DSP2_MISC_CROP_3_ID) || \
                                        ((type) == DSP2_MISC_CROP_ID_MAX))

/** @defgroup  DSP2_MISC_SCALER_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_SCALER_ID_TYPE(type) (((type) == DSP2_MISC_SCALER_0_ID) || \
                                          ((type) == DSP2_MISC_SCALER_1_ID) || \
                                          ((type) == DSP2_MISC_SCALER_2_ID) || \
                                          ((type) == DSP2_MISC_SCALER_3_ID) || \
                                          ((type) == DSP2_MISC_SCALER_ID_MAX))

/** @defgroup  DSP2_MISC_OSD_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_OSD_ID_TYPE(type) (((type) == DSP2_MISC_OSD_0_ID) || \
                                       ((type) == DSP2_MISC_OSD_1_ID) || \
                                       ((type) == DSP2_MISC_OSD_2_ID) || \
                                       ((type) == DSP2_MISC_OSD_3_ID) || \
                                       ((type) == DSP2_MISC_OSD_ID_MAX))

/** @defgroup  DSP2_MISC_ADJUST_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_ADJUST_ID_TYPE(type) (((type) == DSP2_MISC_ADJUST_0_ID) || \
                                          ((type) == DSP2_MISC_ADJUST_1_ID) || \
                                          ((type) == DSP2_MISC_ADJUST_2_ID) || \
                                          ((type) == DSP2_MISC_ADJUST_3_ID) || \
                                          ((type) == DSP2_MISC_ADJUST_ID_MAX))

/** @defgroup  DSP2_MISC_YUV2RGB_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_YUV2RGB_ID_TYPE(type) (((type) == DSP2_MISC_YUV2RGB_DISPLAY_ID) || \
                                           ((type) == DSP2_MISC_YUV2RGB_NORMAL_ID) ||  \
                                           ((type) == DSP2_MISC_YUV2RGB_ID_MAX))

/** @defgroup  DSP2_MISC_FRAME_ID_TYPE
 *  @{
 */
#define IS_DSP2_MISC_FRAME_ID_TYPE(type) (((type) == DSP2_MISC_FRAME_BAYER_ID) || \
                                         ((type) == DSP2_MISC_FRAME_YUV_ID))

/** @defgroup  DSP2_MISC_FRAME_ID_EDGE_TYPE
 *  @{
 */
#define IS_DSP2_MISC_FRAME_ID_EDGE_TYPE(type) (((type) == DSP2_MISC_FRAME_ID_VSYNC_NEGEDGE) || \
                                              ((type) == DSP2_MISC_FRAME_ID_VSYNC_POSEDGE))

/** @defgroup  DSP2_MISC_CAM_INPUT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_CAM_INPUT_TYPE(type) (((type) == DSP2_MISC_CAM_DSP2_INPUT) ||             \
                                          ((type) == DSP2_MISC_CAM_ACTIVE_DVP_OUTPUT) ||     \
                                          ((type) == DSP2_MISC_CAM_DEFECT_CORRECT_OUTPUT) || \
                                          ((type) == DSP2_MISC_CAM_CCM_R_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_CCM_G_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_CCM_B_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_GAMMA_R_OUTPUT) ||        \
                                          ((type) == DSP2_MISC_CAM_GAMMA_G_OUTPUT) ||        \
                                          ((type) == DSP2_MISC_CAM_NONE_OUTPUT) ||           \
                                          ((type) == DSP2_MISC_CAM_BNR_OUTPUT) ||            \
                                          ((type) == DSP2_MISC_CAM_NR_OUTPUT) ||             \
                                          ((type) == DSP2_MISC_CAM_EE_OUTPUT) ||             \
                                          ((type) == DSP2_MISC_CAM_DSP2_OUTPUT) ||            \
                                          ((type) == DSP2_MISC_CAM_OSD_0_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_OSD_1_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_OSD_2_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_OSD_3_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_SCALER_0_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_SCALER_1_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_SCALER_2_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_SCALER_3_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_ADJUST_0_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_ADJUST_1_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_ADJUST_2_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_ADJUST_3_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_YUV420_0_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_YUV420_1_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_YUV420_2_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_YUV420_3_OUTPUT) ||       \
                                          ((type) == DSP2_MISC_CAM_GAMMA_B_OUTPUT) ||        \
                                          ((type) == DSP2_MISC_CAM_WDR_Y_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_WDR_U_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_WDR_V_OUTPUT) ||          \
                                          ((type) == DSP2_MISC_CAM_LSC_OUTPUT) ||            \
                                          ((type) == DSP2_MISC_CAM_AWB2_OUTPUT) ||           \
                                          ((type) == DSP2_MISC_CAM_YUV2RGB_OUTPUT) ||        \
                                          ((type) == DSP2_MISC_CAM_DVP_AS_2X_OUTPUT))

/** @defgroup  DSP2_MISC_SCALER_INPUT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_SCALER_INPUT_TYPE(type) (((type) == DSP2_MISC_SCALER_DSP2_OUTPUT) ||   \
                                             ((type) == DSP2_MISC_SCALER_DSP2_INPUT) ||    \
                                             ((type) == DSP2_MISC_SCALER_OSD_0_OUTPUT) || \
                                             ((type) == DSP2_MISC_SCALER_OSD_1_OUTPUT) || \
                                             ((type) == DSP2_MISC_SCALER_OSD_2_OUTPUT) || \
                                             ((type) == DSP2_MISC_SCALER_OSD_3_OUTPUT))

/** @defgroup  DSP2_MISC_OSD_INPUT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_OSD_INPUT_TYPE(type) (((type) == DSP2_MISC_OSD_DSP2_OUTPUT) ||      \
                                          ((type) == DSP2_MISC_OSD_DSP2_INPUT) ||       \
                                          ((type) == DSP2_MISC_OSD_SCALER_0_OUTPUT) || \
                                          ((type) == DSP2_MISC_OSD_SCALER_1_OUTPUT) || \
                                          ((type) == DSP2_MISC_OSD_SCALER_2_OUTPUT) || \
                                          ((type) == DSP2_MISC_OSD_SCALER_3_OUTPUT) || \
                                          ((type) == DSP2_MISC_OSD_OSD_0_OUTPUT) ||    \
                                          ((type) == DSP2_MISC_OSD_DVP_AS_2X_OUTPUT))

/** @defgroup  DSP2_MISC_YUV2RGB_INPUT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_YUV2RGB_INPUT_TYPE(type) (((type) == DSP2_MISC_YUV2RGB_DSP2_OUTPUT) ||      \
                                              ((type) == DSP2_MISC_YUV2RGB_DSP2_INPUT) ||       \
                                              ((type) == DSP2_MISC_YUV2RGB_OSD_0_OUTPUT) ||    \
                                              ((type) == DSP2_MISC_YUV2RGB_OSD_1_OUTPUT) ||    \
                                              ((type) == DSP2_MISC_YUV2RGB_OSD_2_OUTPUT) ||    \
                                              ((type) == DSP2_MISC_YUV2RGB_OSD_3_OUTPUT) ||    \
                                              ((type) == DSP2_MISC_YUV2RGB_SCALER_0_OUTPUT) || \
                                              ((type) == DSP2_MISC_YUV2RGB_SCALER_1_OUTPUT) || \
                                              ((type) == DSP2_MISC_YUV2RGB_SCALER_2_OUTPUT) || \
                                              ((type) == DSP2_MISC_YUV2RGB_SCALER_3_OUTPUT))

/** @defgroup  DSP2_MISC_BAYER_SHIFT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_BAYER_SHIFT_TYPE(type) (((type) == DSP2_MISC_BAYER_SHIFT_LEFT) || \
                                            ((type) == DSP2_MISC_BAYER_SHIFT_RIGHT))

/** @defgroup  DSP2_MISC_INT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_INT_TYPE(type) (((type) == DSP2_MISC_INT_AWB0) ||    \
                                    ((type) == DSP2_MISC_INT_AE) ||      \
                                    ((type) == DSP2_MISC_INT_WDR) ||     \
                                    ((type) == DSP2_MISC_INT_AWB1) ||    \
                                    ((type) == DSP2_MISC_INT_OSD_PB) ||  \
                                    ((type) == DSP2_MISC_INT_SEOF0) ||   \
                                    ((type) == DSP2_MISC_INT_SEOF1) ||   \
                                    ((type) == DSP2_MISC_INT_SEOF2) ||   \
                                    ((type) == DSP2_MISC_INT_AE_HIST) || \
                                    ((type) == DSP2_MISC_INT_AWB2) ||    \
                                    ((type) == DSP2_MISC_INT_DISPLAY) || \
                                    ((type) == DSP2_MISC_INT_SEOF3) ||   \
                                    ((type) == DSP2_MISC_INT_ALL))

/** @defgroup  DSP2_MISC_SEOF_SOURCE_TYPE
 *  @{
 */
#define IS_DSP2_MISC_SEOF_SOURCE_TYPE(type) (((type) == DSP2_MISC_SEOF_VSYNC_SENSOR) ||     \
                                            ((type) == DSP2_MISC_SEOF_VSYNC_DSP2_ACT) ||    \
                                            ((type) == DSP2_MISC_SEOF_VSYNC_DSP2_OUT) ||    \
                                            ((type) == DSP2_MISC_SEOF_VSYNC_DVP_TSRC) ||    \
                                            ((type) == DSP2_MISC_SEOF_DISPLAY_TEST_SRC) || \
                                            ((type) == DSP2_MISC_SEOF_DISPLAY_OUTPUT))

/** @defgroup  DSP2_MISC_SEOF_EDGE_TYPE
 *  @{
 */
#define IS_DSP2_MISC_SEOF_EDGE_TYPE(type) (((type) == DSP2_MISC_SEOF_VSYNC_NEGEDGE) || \
                                          ((type) == DSP2_MISC_SEOF_VSYNC_POSEDGE))

/** @defgroup  DSP2_MISC_DISPLAY_INPUT_TYPE
 *  @{
 */
#define IS_DSP2_MISC_DISPLAY_INPUT_TYPE(type) (((type) == DSP2_MISC_DISPLAY_YUV2RGB_OUTPUT) || \
                                              ((type) == DSP2_MISC_DISPLAY_YUV422_OUTPUT))

