RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_dsp2_misc.h
/*@} end of group DSP2_MISC_Public_Constants */

/** @defgroup  DSP2_MISC_Public_Macros
 *  @{
 */

/*@} end of group DSP2_MISC_Public_Macros */

/** @defgroup  DSP2_MISC_Public_Functions
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
void SEOF0_IRQHandler(void);
void SEOF1_IRQHandler(void);
void SEOF2_IRQHandler(void);
void SEOF3_IRQHandler(void);
void AWB0_IRQHandler(void);
void AWB1_IRQHandler(void);
void AWB2_IRQHandler(void);
void AE_IRQHandler(void);
void AE_HIST_IRQHandler(void);
void WDR_IRQHandler(void);
void OSD_PB_IRQHandler(void);
void Display_IRQHandler(void);
#endif
void DSP2_MISC_2X_Init(DSP2_MISC_2X_Cfg_Type *dvp2xCfg);
void DSP2_MISC_2X_Enable(void);
void DSP2_MISC_2X_Disable(void);
void DSP2_MISC_CAM_Input_Select(DSP2_MISC_CAM_ID_Type camId, DSP2_MISC_CAM_Input_Type inputType);
void DSP2_MISC_CAM_Frame_ID_Select(DSP2_MISC_CAM_ID_Type camId, DSP2_MISC_Frame_ID_Type idType);
void DSP2_MISC_Frame_ID_Init(DSP2_MISC_Frame_ID_Type idType, DSP2_MISC_Frame_ID_Edge_Type edgeType, uint16_t vsyncCnt);
void DSP2_MISC_Frame_ID_Reset(DSP2_MISC_Frame_ID_Type idType);
void DSP2_MISC_OSD_Input_Select(DSP2_MISC_OSD_ID_Type osdId, DSP2_MISC_OSD_Input_Type inputType);
void DSP2_MISC_OSD_Probe_Input_Select(DSP2_MISC_OSD_Input_Type inputType);
void DSP2_MISC_Crop_Init(DSP2_MISC_Crop_ID_Type cropId, DSP2_MISC_Crop_Cfg_Type *cropCfg);
void DSP2_MISC_Crop_Enable(DSP2_MISC_Crop_ID_Type cropId);
void DSP2_MISC_Crop_Disable(DSP2_MISC_Crop_ID_Type cropId);
void DSP2_MISC_Scaler_Input_Select(DSP2_MISC_Scaler_ID_Type scalerId, DSP2_MISC_Scaler_Input_Type inputType);
void DSP2_MISC_Scaler_Init(DSP2_MISC_Scaler_ID_Type scalerId, DSP2_MISC_Scaler_Cfg_Type *scalerCfg);
void DSP2_MISC_Scaler_Enable(DSP2_MISC_Scaler_ID_Type scalerId);
void DSP2_MISC_Scaler_Disable(DSP2_MISC_Scaler_ID_Type scalerId);
void DSP2_MISC_Scaler_Shadow(DSP2_MISC_Scaler_ID_Type scalerId);
void DSP2_MISC_Adjust_Input_Select(DSP2_MISC_Adjust_ID_Type adjustId, DSP2_MISC_Adjust_Input_Type inputType);
void DSP2_MISC_Adjust_Init(DSP2_MISC_Adjust_ID_Type adjustId, DSP2_MISC_Adjust_Cfg_Type *adjustCfg);
void DSP2_MISC_Adjust_Enable(DSP2_MISC_Adjust_ID_Type adjustId);
void DSP2_MISC_Adjust_Disable(DSP2_MISC_Adjust_ID_Type adjustId);
void DSP2_MISC_Display_Init(DSP2_MISC_Display_Cfg_Type *displayCfg);
void DSP2_MISC_Display_Gamma_Init(DSP2_MISC_Display_Gamma_Cfg_Type *gammaCfg);
void DSP2_MISC_YUV2RGB_Input_Select(DSP2_MISC_YUV2RGB_Input_Type inputType);
void DSP2_MISC_YUV2RGB_Init(DSP2_MISC_YUV2RGB_ID_Type yuv2rgbId, DSP2_MISC_YUV2RGB_Cfg_Type *yuv2rgbCfg);
void DSP2_MISC_RGB2YUV_Init(DSP2_MISC_YUV2RGB_Cfg_Type *rgb2yuvCfg);
void DSP2_MISC_Int_Clear(DSP2_MISC_INT_Type intType);
void DSP2_MISC_Int_Mask(DSP2_MISC_INT_Type intType, BL_Mask_Type intMask);
void DSP2_MISC_Int_Callback_Install(DSP2_MISC_INT_Type intType, intCallback_Type *cbFun);
void DSP2_MISC_SEOF_Set_Source(DSP2_MISC_INT_Type intType, DSP2_MISC_SEOF_Source_Type source);
void DSP2_MISC_SEOF_Set_Edge(DSP2_MISC_INT_Type intType, DSP2_MISC_SEOF_Edge_Type edge);
void DSP2_MISC_Reshape_Init(DSP2_MISC_Reshape_Cfg_Type *reshapeCfg);
void DSP2_MISC_Reshape_Counter_Clear(void);
void DSP2_MISC_DE_As_Hsync(BL_Fun_Type enable);
void DSP2_MISC_TSRC_Source_Select(DSP2_MISC_TSRC_Source_Type sourceType);
void DSP2_MISC_Bayer_Shift(uint16_t bitEnable, DSP2_MISC_Bayer_Shift_Type shiftType, uint8_t bitShift);
void DSP2_MISC_M2N_Enable(uint8_t m, uint8_t n, uint8_t step);
void DSP2_MISC_M2N_Disable(void);

/*@} end of group DSP2_MISC_Public_Functions */

/*@} end of group DSP2_MISC */

/*@} end of group BL808_Peripheral_Driver */

#endif /* __BL808_DSP2_MISC_H__ */
